[M_Ep4_WelcomeToSanctuary MissionDefinition]
MissionDescription="You've made it to [place]Sanctuary[-place]. This would be awesome, were it not for the fact that the man you came here to find -- Roland, the leader of the Crimson Raiders -- went missing shortly before your arrival."

[M_Ep4_WelcomeToSanctuary:BlackMarketSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland is missing. With their leader gone, the Crimson Raiders of [place]Sanctuary[-place] are helpless. Roland left specific instructions with the town mechanic, Scooter, which were to be carried out in the event of his disappearance. Scooter has asked you to help him carry out these instructions, which entail getting [place]Sanctuary[-place] -- which, if you're keeping score, used to be an old mining spaceship -- airborne and out of Jack's reach. Scooter still needs one more fuel cell to get the city airborne. He's asked you to go buy one from Crazy Earl, the local black market vendor. You'll have to spend the Eridium Scooter gave you to get the fuel cell."

[M_Ep4_WelcomeToSanctuary:GetKeysToRolandsPlaceSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've made it to [place]Sanctuary[-place]. This would be awesome, were it not for the fact that the man you came here to find -- a soldier named Roland -- has evidently gone missing. You successfully completed Scooter's project -- an ill-fated attempt to make [place]Sanctuary[-place], once a Dahl corporation mining ship, become airborne again. The project failed, and [place]Sanctuary[-place] is still stuck in the ground. Scooter, now more desperate than ever, has asked you to enter Roland's command center and see if you can find out where he's gone."

[M_Ep4_WelcomeToSanctuary:InsertBlackMarketCellInPylonSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland is missing. With their leader gone, the Crimson Raiders of [place]Sanctuary[-place] are helpless. Roland left specific instructions with the town mechanic, Scooter, which were to be carried out in the event of his disappearance. Scooter has asked you to help him carry out these instructions, which entail getting [place]Sanctuary[-place] -- which, if you're keeping score, used to be an old mining spaceship -- airborne and out of Jack's reach. With the final fuel cell in hand, you're ready to get Sanctuary airborne. Just install it in the center of town."

[M_Ep4_WelcomeToSanctuary:InstallFuelCellsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland is missing. With their leader gone, the Crimson Raiders of [place]Sanctuary[-place] are helpless. Roland left specific instructions with the town mechanic, Scooter, which were to be carried out in the event of his disappearance. Scooter has asked you to help him carry out these instructions, which entail getting [place]Sanctuary[-place] -- which, if you're keeping score, used to be an old mining spaceship -- airborne and out of Jack's reach. Scooter has asked you to install the cells you grabbed into some ignition primers in the middle of the city."

[M_Ep4_WelcomeToSanctuary:PickupScootersItemsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland is missing. With their leader gone, the Crimson Raiders of [place]Sanctuary[-place] are helpless. Roland left specific instructions with the town mechanic, Scooter, which were to be carried out in the event of his disappearance. Scooter has asked you to help him carry out these instructions, which entail getting [place]Sanctuary[-place] -- which, if you're keeping score, used to be an old mining spaceship -- airborne and out of Jack's reach. Scooter has asked you to grab some fuel cells and a hunk of Eridium."

[M_Ep4_WelcomeToSanctuary:SpeakToTownMechanicSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland is missing. With their leader gone, the Crimson Raiders of [place]Sanctuary[-place] are helpless. They've asked you to meet with the town mechanic -- he needs your help with something."
